{
    "description": "During your adventures, you will at some point require rest to replenish your resources and recover from damage.",
    "exhaustion": {
        "description": "When characters push themselves beyond their physical Limits they suffer points of [EXHAUSTION]. Points of [EXHAUSTION] are a cumulative penalty towards the characters abilities and characteristics. Each Point of [EXHAUSTION] gives you a cumulative -1 Penalty to any [D20 TEST].",
        "exhaustionLimitDescription": "A charcter’s [EXHAUSTION] limit is equal to [LEVEL] + [CON] (minimum of 1). If your current points of [EXHAUSTION] exceed your [EXHAUSTION] limit you drop unconcious unless you are at [DEATHS DOOR]. [EXHAUSTION] can be reduced during a Short Rest (see below). If your current points of [EXHAUSTION] exceed twice your [EXHAUSTION] limit you are dead."
    },
    "shortRest": {
        "description": "A short rest is when you quickly take your time to catch your breath. During a short rest, you can use your [STAMINA] to recover [HP] , [ARCANA] and other class specific resources. A short rest takes 1 minute per [STAMINA] used.",
        "options": [
            "You can spend 1 [STAMINA] and recover 2d6 + [CON] HP.",
            "You can spend 1 [STAMINA] and recover [ARCANA] equal to a third your [SPELL LEVEL] (rounded up).",
            "You can spend 2 [STAMINA] to remove one point of [EXHAUSTION]."
        ]
    },
    "longRest": {
        "description": "During a Long Rest you take time to lie down and sleep and recuperate your strength. A long rest takes an amount of time equal to: 8 − [CON]/2 and requires you to have consumed enough food and drank enough water for this day. A long rest can only be completed once within 24 hours. Upon completion of a Long rest, you recover the following Things:",
        "effects": [
            "You recover a third of your [STAMINA], [ARCANA] and [HP] (rounded up).",
            "All your [THP] are removed",
            "You remove one point of [EXHAUSTION]."
        ],
        "interruptedLongRest": "In case a character was interrupted by an ambush or couldn't complete their long rest due to other circumstances they don't get the benefits of a full long rest but at might at least get partial benefits. As such they don't reduce their [EXHAUSTION] and recover 1d6 less [STAMINA], [ARCANA] and [HP] (can't be less than 0). If they complete their long rest afterwards they recieve the remaining benefits."
    },
    "extendedLongRest": {
        "description": "A extended Long Rest has to happen in a settlement in a comfortable bed with food and drink. There is no definite time required but roughly, 1 day with a good nights of sleep and light activity during the day to recover all of their [STAMINA], [ARCANA] and [HP] for the next day and remove 3 points of [EXHAUSTION]. However the GM might require additional days depending on special Injuries or other circumstances."
    }
}