{
    "core_gameplay_introduction": "RtR works smiliar to other d20 game systems where a Games Master (GM) describes a scene for the player upon which they have to decide how their characters want to and the GM tells how these actions play out. If there is uncertanty on the result then the result is resolved with a Dice roll, the most common being a d20 Test.",

    "d20_test": "On a [D20 TEST] you roll a d20 dice and most of a time add a number to the result which decreases or increases the result. This is then compared against a Difficulty Threshold ([DT]) which is a number that has either be met or exceeded in order for the Test to be considered a success. A [D20 TEST] can have many different forms: [ATTRIBUTE TEST], [SAVE], [ATTACK], [MARTIAL TEST], [SPELL TEST] these specialized versions handle various aspects of the game depending on their application and circumstance.<br>If any other ability or effect a [D20 TEST], then all of these specialized forms are also affected unless stated otherwise.",

    "difficulty_threshold": "The difficulty of any [D20 TEST] is measured by the Difficulty Threshld ([DT]). The [DT] should be exlusivly based upon the difficulty of the action the actor attempts. Below are examples on what the [DT] number translates to in difficulty. It should be kept in mind that different forms of a [D20 TEST] can achieve significantly higher bonuses.<div class=\"row pt-4\"> <div class=\"col-2\"></div> <div class=\"col-8\"> <table class=\"table table-striped\">  <thead>  <tr>  <th scope=\"col\">DT Number</th>  <th scope=\"col\">Difficulty Description</th>  </tr>  </thead>  <tbody>  <tr>  <td>5</td>  <td>Trivial task for an avarage person</td>  </tr>  <tr>  <td>10</td>  <td>Challenging task for an avarage person</td>  </tr>  <tr>  <td>15</td>  <td>Difficult task for an avarage person</td>  </tr>  <tr>  <td>20</td>  <td>Difficult task for a trained person in that task</td>  </tr>  <tr>  <td>25</td>  <td>Difficult task for an expert in that task</td>  </tr>  <tr>  <td>30</td>  <td>Difficult task for a genius in that task</td>  </tr>  <tr>  <td>35</td>  <td>Impossible task for almost all mortal persons</td>  </tr>  <tr>  <td>40</td>  <td>Task only achievable by godlike beings</td>  </tr>  </tbody>  </table> </div> <div class=\"col-2\"></div> </div>",

    "advantage_disadvantage": "There are 2 common ways to modify a [D20 TEST], the first one is to just add or subtract a flat number to the test or set the [DT] higher or lower. The second one is to grant advantage/disadvantage.<br>[ADVANTAGE]: You roll the d20 twice and take the better result. <br>[DISADVANTAGE]: You roll the d20 twice and take the worse result.<br>You can only benefit from one instance of [ADVANTAGE] or [DISADVANTAGE] at a time and if a [D20 TEST] has both, they cancel each other out.",

    "degrees_of_success_failure": "Most of the time only success or failure matters, however in certain times you want to know how big of a success or failure the Test was. Any time the the Test exceeds or matches the [DT] + 10 a second Degree of success is scored and an additional degree of success for every additional 10 above the original [DT].<br>The same works also for failures for every time the Test is below or matches [DT] - 10a second degree of failure is scored which increases for every additional 10 below the original [DT].",

    "structured_vs_unstructured_time": "Unless the players are in combat, time is not tracked in a structured way, and time passes as the GM deems to make sense.<br>In combat time is tracked in a structured way, characters take turn to act and characters have a limited amount of actions they can perform each turn."
}