{
    "spellsDescription": "Spells are magical phenomena that are a result of harnessing from the Aether and the Elemental Planes and manifesting it. Almost all living beings have a connection to the Outer Planes, but few are able to effectively and safely harness it. Those who are able to master spellcasting wield tremendous power with which they can shape and destroy reality.",
    "castingSpells": {
        "castingSpellsDescription": "Anyone that has a spellcasting Level Progression that is not 0 can cast spells. Your ability to cast spells depends on various characteristics of your Character.<br><br>Your [SPI] Influences the Impact and Strength of the spells you cast.<br>Your [SPELL LEVEL] determines how expierienced and proficient you are at spellcasting which influences all your [SPELL TEST]s and what’s the highest spell power you are able to cast safely.<br>Various other Attributes are used when casting spell and can influence how effective you are able to cast a spell, for example spells that create ranged projectile might rely on your [PER] while charming or mind-controlling someone can depend on your [CHA]<br>Your [ARCANA] is your Spellcasting reserve, a measure of how much energy you can spend to cast spells. The cost of casting a spell depends on the Spell Power as listed in the Spell Arcana Cost Table.",
        "spellArcanaCost": [
            { "spellPower": "1st", "arcanaCost": 1 },
            { "spellPower": "2nd", "arcanaCost": 3 },
            { "spellPower": "3rd", "arcanaCost": 6 },
            { "spellPower": "4th", "arcanaCost": 10 },
            { "spellPower": "5th", "arcanaCost": 15 },
            { "spellPower": "6th", "arcanaCost": 21 }
        ],
        "spellcastingTests": {
            "spellcastingTestsdescription": "Most spells you are casting require a [SPELL TEST] to be made to determine how effective or the spell is used or if effective at all.<br><br><span class=\"fw-bold\">Rolling a Natural 1 on a [SPELL TEST]</span><br>If the spellcaster rolls a natural 1 for a [SPELL TEST] that is made in the process of casting the spell (Any [CONCENTRATION TEST] and all [SPELL TEST] made after the spell was already successfully cast are excluded). Then they have a chance to trigger a magical mishap similar when Upcasting Spells to a higher Spell Power than they are able to handle.",
            "spellTestDescription": "Certain spells require you to apply spells effectively that depends on a certain Attribute mentioned in the context. For those spells you are required to make a [SPELL TEST] which is a [D20 TEST] where you add your [SPELL LEVEL] and the relevant.",
            "meleeSpellAttackDescription": "Certain spells require you to direct a spell towards a target in close range of you which attempts to dodge that. For these spells make a [MELEE ATTACK] and add your [AGI] + [SPELL LEVEL] to the result and that roll has to exceed the targets [DODGE]. This is also considered a [SPELL TEST].",
            "rangedSpellAttackDescription": "Certain spells require you to hit targets with a magic projectile towards a target which attempts to dodge that. For these spells make a [RANGED ATTACK] and add your [PER] + [SPELL LEVEL] to the result and that roll has to exceed the targets [DODGE]. This is also considered a [SPELL TEST].",
            "concentrationTestDescription": "Certain spells have the Concentration X tag listed at the spell’s duration. These spells require a lot of focus to maintain. Spells with this tag have the following properties: <ul> <li>During your turn you have to spend X AP to maintain the spell, if you don’t do this, the spell stops at the end of your turn.</li> <li>Every time you receive damage, you have to make a Concentration Test with a DC that is equal to 5 + half the damage received.</li> </ul> A [CONCENTRATION TEST] determines if you can maintain focus on a spell while external factors attempt to disrupt it. A [CONCENTRATION TEST] is a specialized [CON] [SPELL TEST]."
        },
        "upcastingSpells": {
            "upcastingSpellsDescription": "Spells can be cast as a higher spell power than the default spell power of the spell. When done so the spell is treated as the higher spell power and the spell’s effect changes as stated in the spell itself. However if spells are upcast to a higher power than can be learned (see Learning New Spells) it is still possible but very hazardous.<br><br><span class=\"fw-bold\">Upcasting Spells to a higher spell power than can be learned</span><br>When casting spells this way, the [ARCANA] is used up before the spell is properly cast a [INT] [SPELL TEST] has to be made. The DC is dependent on the Spell Power and can be taken from the Table below.<br>If the [SPELL TEST] is successfull the spell is cast normally. If the test fails then make a roll on the Spell Mishap Table and add your [SPI] as well as twice the Spell Power to the Result.",
            "upcastingSpellDC": [
                { "spellPower": "2nd", "upcastingDC": "15" },
                { "spellPower": "3rd", "upcastingDC": "20" },
                { "spellPower": "4th", "upcastingDC": "25" },
                { "spellPower": "5th", "upcastingDC": "30" },
                { "spellPower": "6th", "upcastingDC": "35" }
            ]
        },
        "spellComponents": "Spells Require Components to be cast, that can be three categories. All components have to be fulfilled and can’t be replaced unless stated otherwise. Certain components require specific things, which are stated in brackets ().<ul><li><span class=\"fw-bold\">V — Verbal:</span>Verbal components require specific words are incantations uttered and heard. Being deafened, unable to talk or under the effect of the Silence Spell are example which prevent you from using Verbal components. The most common Verbal components are (Incantations) which are specific words uttered in a forgotten language and leave no doubt that a spell is being cast. The other common verbal component are (Prayers) which are at most sentence long prayers to a deity.</li><li><span class=\"fw-bold\">S — Somatic:</span>Somatic components are gestures that need to be performed to cast a spell. They require at least one free hand that is free to do gestures, but it can hold small items or weapons, but not shields. Being restrained or not having a free hand for example when climbing prevents you from performing somatic components.</li><li><span class=\"fw-bold\">M — Material:</span></li>Material components are physical objects that need to be either held or somewhere present for the spell to be cast. Certain spell consume their physical components, which will be marked via an (*). Other spells require objects which have a certain value which will be stated in Gc.</ul>",
        "spellDisciplines": "Spells are categorized by disciplines that describe roughly the effect of the spell and the origin of the magical power. Characters usually can not learn spells from all disciplines, and certain features or perks might change how you interact with spells from a certain discipline. Certain spells can also have multiple disciplines, to be able to learn this spell the character must be able to learn spells of all disciplines.<br>Spells are split into 3 major disciplines, which are again split into different subdisciplines. If you can learn spells of a major discipline, you can then also learn spells of the corresponding subdisciplines. The same goes for effects/perks that interact with major disciplines, they also affect spells of the corresponding subdisciplines.<ul><li><span class=\"fw-bold\">Elemental:</span> Spells from the Elemental Discipline draw their power from the Elemental Planes. They generally deal acid, fire, cold, or lightning damage or otherwise manipulate the elements. The Elemental Discipline is split into 4 subdisciplines, corresponding to the main 4 elemental planes.<ul><li><span class=\"fw-bold\">Pyromancy:</span> Spells from the Pyromancy Discipline deal with fire.</li><li><span class=\"fw-bold\">Hydromancy:</span> Spells from the Hydromancy Discipline deal with water, cold and acid.</li><li><span class=\"fw-bold\">Aeromancy:</span> Spells from the Aeromancy Discipline deal with air and lightning.</li><li><span class=\"fw-bold\">Geomancy:</span> Spells from the Geomancy Discipline deal with rocks, eart and poison.</li></ul></li><li><span class=\"fw-bold\">Cosmic:</span> Spells from the Cosmic Discipline draw their power from Ideals, Hopes, Dreams and Fears of Mortals that is reflected in the Aether.<ul><li><span class=\"fw-bold\">Light:</span> holy damage, summon angles/friendly spirits, light.</li><li><span class=\"fw-bold\">Restoration:</span> Healing magic, remove debuffs/injuries, buff alies.</li><li><span class=\"fw-bold\">Necromancy:</span> Interact with souls, summon undead.</li><li><span class=\"fw-bold\">Shadow:</span> Create darkness, unholy damage.</li><li><span class=\"fw-bold\">Divination:</span> find out something that is known or once was known or is yet to be known.</li></ul></li><li><span class=\"fw-bold\">Manipulation:</span> Spells that interact with raw aether energy to manipulate things in realspace.<ul><li><span class=\"fw-bold\">Telekinesis:</span> move things.</li><li><span class=\"fw-bold\">Transmutation:</span> change thing.</li><li><span class=\"fw-bold\">Conjuration:</span> create non living objects.</li><li><span class=\"fw-bold\">Illusion:</span> create illusions, which unlike conjuration are not real but can trick minds into percieving them as real.</li><li><span class=\"fw-bold\">Teleportation:</span> open places into the Aether and connect them to other places in the Material Plane.</li><li><span class=\"fw-bold\">Telepathy:</span> mind-control people, read-minds of people.</li></ul></li></ul>",
        "learningNewSpells": {
            "learningNewSpellsDescription": "If you want to learn the spell you have to meet these two requirements unless stated otherwise: <ul><li><span class=\"fw-bold\">Spell Power:</span> You have to meet the requirement for casting spells of that power (see Spell Power Requirment Table below)</li><li><span class=\"fw-bold\">Spell Discipline:</span> You must be able to learn spells from the discipline you select.</li></ul>",
            "spellLevelRequirement": [
                { "spellLevel": ">0", "maxSpellPower": "1st" },
                { "spellLevel": "3", "maxSpellPower": "2nd" },
                { "spellLevel": "5", "maxSpellPower": "3rd" },
                { "spellLevel": "7", "maxSpellPower": "4th" },
                { "spellLevel": "9", "maxSpellPower": "5th" },
                { "spellLevel": "12", "maxSpellPower": "6th" }
            ]
        }
    }
}