{
    "defensesDescription": "This section explores your characters defenses against all sorts of harm that the character will likely face during their adventures. Fort the main 4 defenses, these come twofold: a Threshold and a Save Bonus. ",
    "thresholdDescription": "The Threshold is a static value that an ememy has to surpass or meet with their [D20 TEST] in order for their harmful effect to be fully successfull.",
    "saveDescription": "The Bonus is used when the defender themselves has to make a defensive test called a [SAVE] for their defensive characteristic. Such a [SAVE] is a [D20 TEST] using the Bonus of the defensive value.",
    "stabilityDescription": "A representation of the character’s resistance agaisnt being forcefully moved or crushed against their will. It is calculated the following way:<br>Stability Threshold: 10 + [STR] + [LEVEL] ∗ Stability Proficiency (rounded down).<br>Stability Bonus: [STR] + [LEVEL] ∗ Stability Proficiency (rounded down).",
    "dodgeDescription": "A representation of how good the character is at evading danger. It is calculated the following way:<br>Dodge Threshold: 10 + [AGI] + [LEVEL] ∗ Dodge Proficiency (rounded down).<br>Dodge Bonus: [AGI] + [LEVEL] ∗ Dodge Proficiency (rounded down).",
    "toughnessDescription": "A representation of the character’s bodily health and ability to resist internal injuries, poisons and concussions. It is calculated the following way: <br>Toughness Threshold: 10 + [CON] + [LEVEL] ∗Toughness Proficiency (rounded down). <br>Toughness Bonus: [CON] + [LEVEL] ∗ Toughness Proficiency (rounded down).",
    "willpowerDescription": "A representation of how well the character can resist being mind-controlled, feeling fear or resisting other mind affecting effects. It is calculated the following way:<br>Willpower Threshold: 10 + [SPI] + [LEVEL] ∗ Willpower Proficiency (rounded down).<br>Willpower Bonus: [SPI] + [LEVEL] ∗ Willpower Proficiency (rounded down).",
    "damageResistanceDescription": "Damage Resistance ([DR]) provides flat damage reduction against incoming damage, this importantly does not reduce damage that targets your [THP]. The most common form of this is granted by armor which provides [DR] against physical damage.<br>[DR] is written in the following way: [DR] 5 physical"
}