{
    "weaponsDescription": "Below is a list of available weapons that a character can wield to attack his foes.",
    "weaponProficiencyDescription": "Weapon proficiencies represent your ability to effectively wield weapons. It is split up across 4 Ranks, and higher ranks allow you to more difficult weapons as well as gain more uses wielding them. Each time a rank in Weapon Proficiency is gained, it is added to the ranks you already have. The Benefits for each rank are as follows:",
    "weaponProficiencyRanks": [
        { 
            "rank": "Rank 0", 
            "description": "Is able to use simple Weapons without penalty"
        },
        { 
            "rank": "Rank 1", 
            "description": "Is able to use advanced Weapons without penalty"
        },
        { 
            "rank": "Rank 2", 
            "description": "You can adapt your fighting style and add one of the following properties to any weapon you are wielding: armour-piercing, shieldbreaker or duelist. After a long rest you can exchange on property of to a different one."
        },
        { 
            "rank": "Rank 3", 
            "description": "You can wield weapons in ways others can't, add one of the following properties to any weapon you are wielding: reach or heavy (must be wielded two-handed). After a long rest you can exchange on property of to a different one."
        }
    ],
    "weaponProperties": [
        {
            "name": "armour-piercing",
            "description": "Damage with this weapon ignores half of the physical resistance of the target that is granted by armour."
        },
        {
            "name": "shieldbreaker",
            "description": "If a Weapon Attack with this weapon is blocked by a shield, that damage is doubled for the purposes of determining if the shield gets destroyed."
        },
        {
            "name": "duelist",
            "description": "When performing a parry with this weapon, the [MELEE MARTIAL ATTACK] to determine if the parry is successful is made with [ADVANTAGE]"
        },
        {
            "name": "heavy",
            "description": "When making a Weapon Attack with a heavy weapon you can alternatively perform a heavy Weapon Attack. By doing this you can increase the cost by 1 [AP] but deal extra physcial damage equal to ([STR]/4) * d12."
        },
        {
            "name": "light",
            "description": "When wielding a light weapon in one hand, you can wield another light weapon in the other hand. You can perform a dual-wield Attack which is a single ability where you perform 2 Weapon Attacks at a total cost of 3 [AP]."
        },
        {
            "name": "loading(x, y [AP])",
            "description": "Weapon has to be reloaded after firing x times. Reloading can be done by the reload ability which requires ammunition and costs y [AP]. However loading weapons are usually quick and easy to fire and only require 1 [AP] to be fired."
        },
        {
            "name": "ranged(x/2x/4x)",
            "description": "The weapon is designed to hit targets further away. Similar to thrown weapons, they come with 3 ranges. If the target is within the first range, you suffer no penalties. If it is within the second, you suffer a -2 to hit and damage, if it is within the third range, you suffer a -5 to hit and damage. If it exceeds all ranges, you automatically miss. Ranged weapons also up ammunitions for their attacks. Certain ammunition can be recovered after the Battle, up to half (rounded down) of the used ammunition. There are also different types of ammunitions that can be used and change the behaviour of a weapon."
        },
        {
            "name": "reach",
            "description": "When wielding this weapon your [MELEE RANGE] is increased by 1.5m"
        },
        {
            "name": "thrown(x/2x/4x)",
            "description": "This weapon can also be thrown to make a [RANGED MARTIAL ATTACK]. Similar to ranged weapons, they come with 3 ranges. If the target is within the first range, you suffer no penalties. If it is within the second, you suffer a -2 to hit and damage, if it is within the third range, you suffer a -5 to hit and damage. If it exceeds all ranges, you automatically miss."
        },
        {
            "name": "two-handed",
            "description": "Weapon requires two hands to attack with effectively, when attempting to do so one-handed any [ATTACK] is made with [DISADVANTAGE] and the damage is only your one handed [MARTIAL DAMAGE]. Additionally if this is a ranged weapon it must use the one handed [MARTIAL DAMAGE] anyways."
        },
        {
            "name": "versatile",
            "description": "This weapon can either be used one-handed or two-handed. When the weapon is used two-handed you are also eligable to use the heavy [MARTIAL DAMAGE] for determining damagte with weapon attacks."
        }
    ],
    "weaponQuality": {
        "weaponQualityDescription": "Weapons can be found in varying qualities of craftsmanship or condition. These are grouped in three different qualities, which affect the weapon’s price and effectiveness",
        "weaponQualities": [
            {
                "quality": "Crude",
                "modifier": "-1 to item tier, -1 to [ATTACK] and damage",
                "price": "25%"
            },
            {
                "quality": "Regular",
                "modifier": "-",
                "price": "100%"
            },
            {
                "quality": "Masterwork",
                "modifier": "+1 to item tier, +1 to the [ATTACK]",
                "price": "400%"
            }
        ]
    }
}