{
    "description": "When creating a character the follwowing steps are involved. While it is recommended to follow the steps in the order listed below. that is not required.",
    "characterCreationSteps": [
        "Choose a species",
        "Determine your origin",
        "Choose a class",
        "Assign your attributes",
        "Choose your Level 1 Abilities and Perks",
        "Select your starting equipment",
        "Finish character details",
        "Optional: choose party origin"
    ],
    "selectAClass": {
        "description": "Now you should choose one of the following classes below. The Class determines the core set of abilities your character is able to use out- but especially in-combat. When your character reaches higher levels, their abilities become stronger and they will gain newer ones. Your class will later also allow you to specialize in different ways. <br> Below are summaries for each Class which show you the key characteristics of each class which are explained below:"
    },
    "assignYourAttributers": {
        "description": "Each Attribute represents one Aspect of your Character and is denoted by a number, an average human is expected to have an Attribute of 0. A higher Attribute grants you a higher bonus for an [ATTRIBUTE TEST] made with that Attribute, or might increase different bonuses or other values.",
        "assigningAttributesDescription": "You have 8 Attribute Points, you can spend one attribute point to improve an Attribute by 1. You can additionally reduce one Attribute by 1 and gain an additional Attribute Point, but you can’t do so more than twice per Attribute . This assignment happens after all Attribute increases from your origin and Main Class Attributes are applied.<br> You are, however, not allowed to improve an Attribute beyond your attribute limit. At first [LEVEL], this limit is 3 and will increase as your [LEVEL] increases. There is one exception, your Main Class Attributes have their limit increased by 2."
    },
    "chooseLevel1AbilitiesAndPerks": {
        "description": "Choose class techniques, martial maneuvers, spells and perks"
    },
    "selectYourStartingEquipment": {
        "description": "You start with 25 + 6d6 gc . With the starting Money you are given, you can purchase any equipment found in the Equipment Section"
    },
    "finishCharacterDetails": {
        "description": "Give your character a name and choose a fitting alignment."
    },
    "partyOrigin": {
        "description": "Optional, can set your party origin, binding moment, maybe had same mentor, lost common friend"
    }
}